---
kind: method
id: M:Autodesk.Revit.DB.FamilySymbol.CanHaveStructuralSection
zh: 族类型、族符号
source: html/d78f43f9-9744-2f76-41d3-ff7506e7a35a.htm
---
# Autodesk.Revit.DB.FamilySymbol.CanHaveStructuralSection Method

**中文**: 族类型、族符号

Identifies if this FamilySymbol can have a structural section.

## Syntax (C#)
```csharp
public bool CanHaveStructuralSection()
```

## Returns
True if the FamilySymbol can have structural section, false otherwise.